---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.NoisePhase
source: html/242adaa0-1c74-8a7b-60b0-fb7243391225.htm
---
# Autodesk.Revit.DB.Visual.Noise.NoisePhase Property

The property labeled "Phase" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string NoisePhase { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".